# install stuff from the repos excluding aur installs
# generate a list of aur packages with
# pacman -Qqm
# List packages installed from the official repositories.
# pacman -Qq | grep -Fv -f <(pacman -Qqm)
# Installing from the package list:
# pacman -S $(cat pacman.list)
# or
# for x in $(cat pacman.list); do pacman -S $x; done
# https://bbs.archlinux.org/viewtopic.php?pid=470581#p470581
dmidecode
base-devel
bijiben
php-composer
conky
seahorse
#devhelp
emacs
firefox
gedit
gedit-code-assistance
zsh-doc
gnome
gnome-icon-theme-extras
gnome-power-manager
pamac
gnome-tweak-tool
gnome-sound-recorder
#gnome-photos
#geary
gnome-calendar
go
#linux318-virtualbox-host-modules
logwatch
#mercurial
nodejs
npm
python2-pip
python-pip
ruby-ronn
#sparkleshare
terminator
#thunderbird
tmux
thefuck
txt2man
vagrant
vim
virtualbox
vlc
weechat
yaourt
zim
zsh
# XXX https://github.com/ggreer/the_silver_searcher
the_silver_searcher
