# install stuff from the repos excluding aur installs
# generate a list of aur packages with
# pacman -Qqm
# List packages installed from the official repositories.
# pacman -Qq | grep -Fv -f <(pacman -Qqm)
# Installing from the package list:
# pacman -S $(cat pacman.list)
# or
# for x in $(cat pacman.list); do pacman -S $x; done
# https://bbs.archlinux.org/viewtopic.php?pid=470581#p470581
dmidecode
base-devel
bijiben
php-composer
#conky
#seahorse
#devhelp
#emacs
chrome-gnome-shell
docker
docker-compose
firefox
gedit
gedit-code-assistance
irssi
zsh-doc
gnome
gnome-icon-theme-extras
gnome-power-manager
#pamac
gnome-tweak-tool
gnome-sound-recorder
#gnome-photos
#geary
#gnome-calendar
#go
#linux318-virtualbox-host-modules
#logwatch
#mercurial
nodejs
npm
python2-pip
python-pip
#ruby-ronn
#sparkleshare
terminator
#thunderbird
tmux
thefuck
txt2man
#vagrant
vim
#virtualbox
#It seems vlc can't use gui without qt4
#https://forum.manjaro.org/t/vlc-not-running-16-08-pre1-rt7-kernel/6474/12
qt4
vlc
#weechat
yaourt
zim
zsh
